"""
Создать программу, которая импортирует класс из предыдущей задачи, создает объект и при
инициализации устанавливает марку Mercedes, модель E500,
год выпуска 2000. Далее “разгоняет” машину до 100 км/ч и выводит скорость на экран.
"""
from solution_01 import Car

auto = Car()
auto.brand = "Mercedes"
auto.model = "E500"
auto.year = 2000
auto.speed = 100
print(auto.speed)

